Revit 2024 API
NumberSystem.JustifyOffset Property
 The offset to the justification curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double JustifyOffset { get; set; }
Visual Basic
Public Property JustifyOffset As Double
	Get
	Set
Visual C++
public:
property double JustifyOffset {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for justifyOffset must be no more than 30000 feet in absolute value.
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace